ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_i2c.cpp
/**
  ******************************************************************************
  * @file    stm32f10x_i2c.c
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    11-March-2011
  * @brief   This file provides all the I2C firmware functions.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_rcc.h"
#include "stm32f10x_i2c.h"
uint16_t I2C::ObjectNum[2] = {0,0};
/** @addtogroup STM32F10x_StdPeriph_Driver
  * @{
  */

/** @defgroup I2C
  * @brief I2C driver modules
  * @{
  */

/** @defgroup I2C_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup I2C_Private_Defines
  * @{
  */

/* I2C SPE mask */
#define CR1_PE_Set              ((uint16_t)0x0001)
#define CR1_PE_Reset            ((uint16_t)0xFFFE)

/* I2C START mask */
#define CR1_START_Set           ((uint16_t)0x0100)
#define CR1_START_Reset         ((uint16_t)0xFEFF)

/* I2C STOP mask */
#define CR1_STOP_Set            ((uint16_t)0x0200)
#define CR1_STOP_Reset          ((uint16_t)0xFDFF)

/* I2C ACK mask */
#define CR1_ACK_Set             ((uint16_t)0x0400)
#define CR1_ACK_Reset           ((uint16_t)0xFBFF)

/* I2C ENGC mask */
#define CR1_ENGC_Set            ((uint16_t)0x0040)
#define CR1_ENGC_Reset          ((uint16_t)0xFFBF)

/* I2C SWRST mask */
#define CR1_SWRST_Set           ((uint16_t)0x8000)
#define CR1_SWRST_Reset         ((uint16_t)0x7FFF)

/* I2C PEC mask */
#define CR1_PEC_Set             ((uint16_t)0x1000)
#define CR1_PEC_Reset           ((uint16_t)0xEFFF)

/* I2C ENPEC mask */
#define CR1_ENPEC_Set           ((uint16_t)0x0020)
#define CR1_ENPEC_Reset         ((uint16_t)0xFFDF)

/* I2C ENARP mask */
#define CR1_ENARP_Set           ((uint16_t)0x0010)
#define CR1_ENARP_Reset         ((uint16_t)0xFFEF)

/* I2C NOSTRETCH mask */
#define CR1_NOSTRETCH_Set       ((uint16_t)0x0080)
#define CR1_NOSTRETCH_Reset     ((uint16_t)0xFF7F)

/* I2C registers Masks */
#define CR1_CLEAR_Mask          ((uint16_t)0xFBF5)

/* I2C DMAEN mask */
#define CR2_DMAEN_Set           ((uint16_t)0x0800)
#define CR2_DMAEN_Reset         ((uint16_t)0xF7FF)

/* I2C LAST mask */
#define CR2_LAST_Set            ((uint16_t)0x1000)
#define CR2_LAST_Reset          ((uint16_t)0xEFFF)

/* I2C FREQ mask */
#define CR2_FREQ_Reset          ((uint16_t)0xFFC0)

/* I2C ADD0 mask */
#define OAR1_ADD0_Set           ((uint16_t)0x0001)
#define OAR1_ADD0_Reset         ((uint16_t)0xFFFE)

/* I2C ENDUAL mask */
#define OAR2_ENDUAL_Set         ((uint16_t)0x0001)
#define OAR2_ENDUAL_Reset       ((uint16_t)0xFFFE)

/* I2C ADD2 mask */
#define OAR2_ADD2_Reset         ((uint16_t)0xFF01)

/* I2C F/S mask */
#define CCR_FS_Set              ((uint16_t)0x8000)

/* I2C CCR mask */
#define CCR_CCR_Set             ((uint16_t)0x0FFF)

/* I2C FLAG mask */
#define FLAG_Mask               ((uint32_t)0x00FFFFFF)

/* I2C Interrupt Enable mask */
#define ITEN_Mask               ((uint32_t)0x07000000)

/**
  * @}
  */

/** @defgroup I2C_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup I2C_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup I2C_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

void I2C::Increase(void)
{
	switch((uint32_t)I2Cx)
	{
		case I2C1_BASE:
			ObjectNum[0]++;
			break;
		case I2C2_BASE:
			ObjectNum[1]++;
			break;
	}
}

uint16_t I2C::Decrease(void)
{
	switch((uint32_t)I2Cx)
	{
		case I2C1_BASE:
			return --ObjectNum[0];
		case I2C2_BASE:
			return --ObjectNum[1];
	}
	return 0xFFFF;
}

I2C::I2C(I2C_TypeDef* _I2Cx, uint16_t OwnAddress1, uint32_t ClockSpeed, uint16_t Mode, uint16_t DutyCycle, uint16_t Ack, uint16_t AcknowledgedAddress) :I2Cx(_I2Cx)
{
	I2C::InitTypeDef aaa;
	this->Increase();
	aaa.ClockSpeed = ClockSpeed;
	aaa.Mode = Mode;
	aaa.DutyCycle = DutyCycle;
	aaa.OwnAddress1 = OwnAddress1;
	aaa.Ack = Ack;
	aaa.AcknowledgedAddress = AcknowledgedAddress;
	this->Init(aaa);
	this->On();
}

void I2C::On()
{
	this->Cmd(ENABLE);   //启动外设
}

void I2C::Off()
{
	this->Cmd(DISABLE);   //关闭外设
}

I2C& I2C::operator<<(uint8_t Data)
{
	this->SendData(Data);
	while(not this->CheckEvent(I2C_EVENT_MASTER_BYTE_TRANSMITTED));
	return *this;
}

I2C& I2C::operator>>(uint8_t& Data)
{
	while(not this->CheckEvent(I2C_EVENT_MASTER_BYTE_RECEIVED));
	Data = this->ReceiveData();
	return *this;
}

I2C_TypeDef* I2C::GetPeriphPointer(void)
{
	return this->I2Cx;
}

I2C::I2C(I2C_TypeDef* _I2Cx, InitTypeDef& InitStruct) :I2Cx(_I2Cx)
{
	this->Increase();
	this->Init(InitStruct);
	this->On();
}

I2C::I2C(const I2C& Other)
{
	this->I2Cx = Other.I2Cx;
	this->Increase();
}

/** @defgroup I2C_Private_Functions
  * @{
  */
I2C::~I2C()
{
	if(this->Decrease()==0)
	{
		this->Off();
		RCC::ClockCmd(*this,DISABLE);
	}
}
/**
  * @brief  Deinitializes the I2Cx peripheral registers to their default reset values.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @retval None
  */
void I2C::DeInit(void)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));

	if(I2Cx == I2C1)
	{
		/* Enable I2C1 reset state */
		RCC::APB1PeriphResetCmd(RCC_APB1Periph_I2C1, ENABLE);
		/* Release I2C1 from reset state */
		RCC::APB1PeriphResetCmd(RCC_APB1Periph_I2C1, DISABLE);
	}
	else
	{
		/* Enable I2C2 reset state */
		RCC::APB1PeriphResetCmd(RCC_APB1Periph_I2C2, ENABLE);
		/* Release I2C2 from reset state */
		RCC::APB1PeriphResetCmd(RCC_APB1Periph_I2C2, DISABLE);
	}
}

/**
  * @brief  Initializes the I2Cx peripheral according to the specified
  *   parameters in the I2C_InitStruct.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  I2C_InitStruct: pointer to a I2C_InitTypeDef structure that
  *   contains the configuration information for the specified I2C peripheral.
  * @retval None
  */
void I2C::Init(InitTypeDef &InitStruct)
{
	uint16_t tmpreg = 0, freqrange = 0;
	uint16_t result = 0x04;
	uint32_t pclk1 = 8000000;
	RCC_ClocksTypeDef  rcc_clocks;
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_I2C_CLOCK_SPEED(InitStruct.ClockSpeed));
	assert_param(IS_I2C_MODE(InitStruct.Mode));
	assert_param(IS_I2C_DUTY_CYCLE(InitStruct.DutyCycle));
	assert_param(IS_I2C_OWN_ADDRESS1(InitStruct.OwnAddress1));
	assert_param(IS_I2C_ACK_STATE(InitStruct.Ack));
	assert_param(IS_I2C_ACKNOWLEDGE_ADDRESS(InitStruct.AcknowledgedAddress));
	RCC::ClockCmd(*this,ENABLE);
	/*---------------------------- I2Cx CR2 Configuration ------------------------*/
	/* Get the I2Cx CR2 value */
	tmpreg = I2Cx->CR2;
	/* Clear frequency FREQ[5:0] bits */
	tmpreg &= CR2_FREQ_Reset;
	/* Get pclk1 frequency value */
	RCC::GetClocksFreq(rcc_clocks);
	pclk1 = rcc_clocks.PCLK1_Frequency;
	/* Set frequency bits depending on pclk1 value */
	freqrange = (uint16_t)(pclk1 / 1000000);
	tmpreg |= freqrange;
	/* Write to I2Cx CR2 */
	I2Cx->CR2 = tmpreg;

	/*---------------------------- I2Cx CCR Configuration ------------------------*/
	/* Disable the selected I2C peripheral to configure TRISE */
	I2Cx->CR1 &= CR1_PE_Reset;
	/* Reset tmpreg value */
	/* Clear F/S, DUTY and CCR[11:0] bits */
	tmpreg = 0;

	/* Configure speed in standard mode */
	if(InitStruct.ClockSpeed <= 100000)
	{
		/* Standard mode speed calculate */
		result = (uint16_t)(pclk1 / (InitStruct.ClockSpeed << 1));
		/* Test if CCR value is under 0x4*/
		if(result < 0x04)
		{
			/* Set minimum allowed value */
			result = 0x04;
		}
		/* Set speed value for standard mode */
		tmpreg |= result;
		/* Set Maximum Rise Time for standard mode */
		I2Cx->TRISE = freqrange + 1;
	}
	/* Configure speed in fast mode */
	else /*(InitStruct.ClockSpeed <= 400000)*/
	{
		if(InitStruct.DutyCycle == I2C_DutyCycle_2)
		{
			/* Fast mode speed calculate: Tlow/Thigh = 2 */
			result = (uint16_t)(pclk1 / (InitStruct.ClockSpeed * 3));
		}
		else /*InitStruct.DutyCycle == I2C_DutyCycle_16_9*/
		{
			/* Fast mode speed calculate: Tlow/Thigh = 16/9 */
			result = (uint16_t)(pclk1 / (InitStruct.ClockSpeed * 25));
			/* Set DUTY bit */
			result |= I2C_DutyCycle_16_9;
		}

