ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_i2c.cpp
		/* Test if CCR value is under 0x1*/
		if((result & CCR_CCR_Set) == 0)
		{
			/* Set minimum allowed value */
			result |= (uint16_t)0x0001;
		}
		/* Set speed value and set F/S bit for fast mode */
		tmpreg |= (uint16_t)(result | CCR_FS_Set);
		/* Set Maximum Rise Time for fast mode */
		I2Cx->TRISE = (uint16_t)(((freqrange * (uint16_t)300) / (uint16_t)1000) + (uint16_t)1);
	}

	/* Write to I2Cx CCR */
	I2Cx->CCR = tmpreg;
	/* Enable the selected I2C peripheral */
	I2Cx->CR1 |= CR1_PE_Set;

	/*---------------------------- I2Cx CR1 Configuration ------------------------*/
	/* Get the I2Cx CR1 value */
	tmpreg = I2Cx->CR1;
	/* Clear ACK, SMBTYPE and  SMBUS bits */
	tmpreg &= CR1_CLEAR_Mask;
	/* Configure I2Cx: mode and acknowledgement */
	/* Set SMBTYPE and SMBUS bits according to Mode value */
	/* Set ACK bit according to Ack value */
	tmpreg |= (uint16_t)((uint32_t)InitStruct.Mode | InitStruct.Ack);
	/* Write to I2Cx CR1 */
	I2Cx->CR1 = tmpreg;

	/*---------------------------- I2Cx OAR1 Configuration -----------------------*/
	/* Set I2Cx Own Address1 and acknowledged address */
	I2Cx->OAR1 = (InitStruct.AcknowledgedAddress | InitStruct.OwnAddress1);
}

/**
  * @brief  Fills each I2C_InitStruct member with its default value.
  * @param  I2C_InitStruct: pointer to an I2C_InitTypeDef structure which will be initialized.
  * @retval None
  */
void I2C::StructInit(InitTypeDef &InitStruct)
{
	/*---------------- Reset I2C init structure parameters values ----------------*/
	/* initialize the ClockSpeed member */
	InitStruct.ClockSpeed = 5000;
	/* Initialize the Mode member */
	InitStruct.Mode = I2C_Mode_I2C;
	/* Initialize the DutyCycle member */
	InitStruct.DutyCycle = I2C_DutyCycle_2;
	/* Initialize the OwnAddress1 member */
	InitStruct.OwnAddress1 = 0;
	/* Initialize the Ack member */
	InitStruct.Ack = I2C_Ack_Disable;
	/* Initialize the AcknowledgedAddress member */
	InitStruct.AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
}

/**
  * @brief  Enables or disables the specified I2C peripheral.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  NewState: new state of the I2Cx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C::Cmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable the selected I2C peripheral */
		I2Cx->CR1 |= CR1_PE_Set;
	}
	else
	{
		/* Disable the selected I2C peripheral */
		I2Cx->CR1 &= CR1_PE_Reset;
	}
}

/**
  * @brief  Enables or disables the specified I2C DMA requests.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  NewState: new state of the I2C DMA transfer.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C::DMACmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable the selected I2C DMA requests */
		I2Cx->CR2 |= CR2_DMAEN_Set;
	}
	else
	{
		/* Disable the selected I2C DMA requests */
		I2Cx->CR2 &= CR2_DMAEN_Reset;
	}
}

/**
  * @brief  Specifies if the next DMA transfer will be the last one.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  NewState: new state of the I2C DMA last transfer.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C::DMALastTransferCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Next DMA transfer is the last transfer */
		I2Cx->CR2 |= CR2_LAST_Set;
	}
	else
	{
		/* Next DMA transfer is not the last transfer */
		I2Cx->CR2 &= CR2_LAST_Reset;
	}
}

/**
  * @brief  Generates I2Cx communication START condition.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  NewState: new state of the I2C START condition generation.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None.
  */
void I2C::GenerateSTART(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Generate a START condition */
		I2Cx->CR1 |= CR1_START_Set;
	}
	else
	{
		/* Disable the START condition generation */
		I2Cx->CR1 &= CR1_START_Reset;
	}
}

/**
  * @brief  Generates I2Cx communication STOP condition.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  NewState: new state of the I2C STOP condition generation.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None.
  */
void I2C::GenerateSTOP(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Generate a STOP condition */
		I2Cx->CR1 |= CR1_STOP_Set;
	}
	else
	{
		/* Disable the STOP condition generation */
		I2Cx->CR1 &= CR1_STOP_Reset;
	}
}

/**
  * @brief  Enables or disables the specified I2C acknowledge feature.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  NewState: new state of the I2C Acknowledgement.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None.
  */
void I2C::AcknowledgeConfig(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable the acknowledgement */
		I2Cx->CR1 |= CR1_ACK_Set;
	}
	else
	{
		/* Disable the acknowledgement */
		I2Cx->CR1 &= CR1_ACK_Reset;
	}
}

/**
  * @brief  Configures the specified I2C own address2.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  Address: specifies the 7bit I2C own address2.
  * @retval None.
  */
void I2C::OwnAddress2Config(uint8_t Address)
{
	uint16_t tmpreg = 0;

	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));

	/* Get the old register value */
	tmpreg = I2Cx->OAR2;

	/* Reset I2Cx Own address2 bit [7:1] */
	tmpreg &= OAR2_ADD2_Reset;

	/* Set I2Cx Own address2 */
	tmpreg |= (uint16_t)((uint16_t)Address & (uint16_t)0x00FE);

	/* Store the new register value */
	I2Cx->OAR2 = tmpreg;
}

/**
  * @brief  Enables or disables the specified I2C dual addressing mode.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  NewState: new state of the I2C dual addressing mode.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C::DualAddressCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable dual addressing mode */
		I2Cx->OAR2 |= OAR2_ENDUAL_Set;
	}
	else
	{
		/* Disable dual addressing mode */
		I2Cx->OAR2 &= OAR2_ENDUAL_Reset;
	}
}

/**
  * @brief  Enables or disables the specified I2C general call feature.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  NewState: new state of the I2C General call.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C::GeneralCallCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable generall call */
		I2Cx->CR1 |= CR1_ENGC_Set;
	}
	else
	{
		/* Disable generall call */
		I2Cx->CR1 &= CR1_ENGC_Reset;
	}
}

/**
  * @brief  Enables or disables the specified I2C interrupts.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  I2C_IT: specifies the I2C interrupts sources to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg I2C_IT_BUF: Buffer interrupt mask
  *     @arg I2C_IT_EVT: Event interrupt mask
  *     @arg I2C_IT_ERR: Error interrupt mask
  * @param  NewState: new state of the specified I2C interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C::ITConfig(uint16_t I2C_IT, FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	assert_param(IS_I2C_CONFIG_IT(I2C_IT));

	if(NewState != DISABLE)
	{
		/* Enable the selected I2C interrupts */
		I2Cx->CR2 |= I2C_IT;
	}
	else
	{
		/* Disable the selected I2C interrupts */
		I2Cx->CR2 &= (uint16_t)~I2C_IT;
	}
}

/**
  * @brief  Sends a data byte through the I2Cx peripheral.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  Data: Byte to be transmitted..
  * @retval None
  */
void I2C::SendData(uint8_t Data)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	/* Write in the DR register the data to be sent */
	I2Cx->DR = Data;
}

/**
  * @brief  Returns the most recent received data by the I2Cx peripheral.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @retval The value of the received data.
  */
uint8_t I2C::ReceiveData(void)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	/* Return the data in the DR register */
	return (uint8_t)I2Cx->DR;
}

/**
  * @brief  Transmits the address byte to select the slave device.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  Address: specifies the slave address which will be transmitted
  * @param  I2C_Direction: specifies whether the I2C device will be a
  *   Transmitter or a Receiver. This parameter can be one of the following values
  *     @arg I2C_Direction_Transmitter: Transmitter mode
  *     @arg I2C_Direction_Receiver: Receiver mode
  * @retval None.
  */
void I2C::Send7bitAddress(uint8_t Address, uint8_t I2C_Direction)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_I2C_DIRECTION(I2C_Direction));
	Address<<=1;
	/* Test on the direction to set/reset the read/write bit */
	if(I2C_Direction != I2C_Direction_Transmitter)
	{
		/* Set the address bit0 for read */
		Address |= OAR1_ADD0_Set;
	}
	else
	{
		/* Reset the address bit0 for write */
		Address &= OAR1_ADD0_Reset;
	}
	/* Send the address */
	I2Cx->DR = Address;
}

/**
  * @brief  Reads the specified I2C register and returns its value.
  * @param  I2C_Register: specifies the register to read.
  *   This parameter can be one of the following values:
  *     @arg I2C_Register_CR1:  CR1 register.
  *     @arg I2C_Register_CR2:   CR2 register.
  *     @arg I2C_Register_OAR1:  OAR1 register.
  *     @arg I2C_Register_OAR2:  OAR2 register.
  *     @arg I2C_Register_DR:    DR register.
  *     @arg I2C_Register_SR1:   SR1 register.
  *     @arg I2C_Register_SR2:   SR2 register.
  *     @arg I2C_Register_CCR:   CCR register.
  *     @arg I2C_Register_TRISE: TRISE register.
  * @retval The value of the read register.
  */
uint16_t I2C::ReadRegister(uint8_t I2C_Register)
{
	__IO uint32_t tmp = 0;

	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_I2C_REGISTER(I2C_Register));

	tmp = (uint32_t) I2Cx;
	tmp += I2C_Register;

	/* Return the selected register value */
	return (*(__IO uint16_t *) tmp);
}

/**
  * @brief  Enables or disables the specified I2C software reset.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  NewState: new state of the I2C software reset.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C::SoftwareResetCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Peripheral under reset */
		I2Cx->CR1 |= CR1_SWRST_Set;
	}
	else
	{
		/* Peripheral not under reset */
		I2Cx->CR1 &= CR1_SWRST_Reset;
	}
}

/**
  * @brief  Selects the specified I2C NACK position in master receiver mode.
  *         This function is useful in I2C Master Receiver mode when the number
  *         of data to be received is equal to 2. In this case, this function
  *         should be called (with parameter I2C_NACKPosition_Next) before data
  *         reception starts,as described in the 2-byte reception procedure
  *         recommended in Reference Manual in Section: Master receiver.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  I2C_NACKPosition: specifies the NACK position.
  *   This parameter can be one of the following values:
  *     @arg I2C_NACKPosition_Next: indicates that the next byte will be the last
  *          received byte.
  *     @arg I2C_NACKPosition_Current: indicates that current byte is the last
  *          received byte.
  *
  * @note    This function configures the same bit (POS) as I2C_PECPositionConfig()
  *          but is intended to be used in I2C mode while I2C_PECPositionConfig()
  *          is intended to used in SMBUS mode.
  *
  * @retval None
  */
void I2C::NACKPositionConfig(uint16_t I2C_NACKPosition)
{
	/* Check the parameters */
	assert_param(IS_I2C_ALL_PERIPH(I2Cx));
	assert_param(IS_I2C_NACK_POSITION(I2C_NACKPosition));

